{"format": "graph-model", "generatedBy": "2.6.0", "convertedBy": "TensorFlow.js Converter v3.9.0", "signature": {"inputs": {"x": {"name": "x:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "409"}]}}}, "outputs": {"21": {"name": "Identity_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "409"}]}}, "Identity_1:0": {"name": "Identity_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "100"}]}}, "Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "100"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/onnx_tf_prefix_Slice_9/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_9/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "PartitionedCall/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/clip_by_value/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "PartitionedCall/ones", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "409"}]}}}}}, {"name": "PartitionedCall/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "409"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/transpose_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "200"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_8/begin", "op": "Const", "attr": {"dtype": {"type": "DT_INT64"}, "value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_8/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/transpose_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "200"}]}}}}}, {"name": "PartitionedCall/mul_6", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}]}}}}}, {"name": "PartitionedCall/transpose_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "200"}, {"size": "409"}]}}}}}, {"name": "PartitionedCall/mul_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "409"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "x", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "409"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_0/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sum", "op": "Sum", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_0/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/Max", "op": "Max", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sqrt", "PartitionedCall/Const_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/clip_by_value/Minimum", "op": "Minimum", "input": ["PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sqrt", "PartitionedCall/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/clip_by_value", "op": "Maximum", "input": ["PartitionedCall/clip_by_value/Minimum", "PartitionedCall/clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/mul", "op": "Mul", "input": ["PartitionedCall/clip_by_value", "PartitionedCall/ones"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Div_4", "op": "RealDiv", "input": ["x", "PartitionedCall/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["PartitionedCall/onnx_tf_prefix_Div_4", "PartitionedCall/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/MatMul", "op": "MatMul", "input": ["PartitionedCall/flatten/Reshape", "PartitionedCall/transpose"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "PartitionedCall/add", "op": "AddV2", "input": ["PartitionedCall/MatMul", "PartitionedCall/mul_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Tanh_6", "op": "Tanh", "input": ["PartitionedCall/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_1", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_Tanh_6", "PartitionedCall/transpose_1"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/add_1", "op": "AddV2", "input": ["PartitionedCall/MatMul_1", "PartitionedCall/mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_9", "op": "Slice", "input": ["PartitionedCall/add_1", "PartitionedCall/onnx_tf_prefix_Slice_9/begin", "PartitionedCall/onnx_tf_prefix_Slice_9/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT64"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_8", "op": "Slice", "input": ["PartitionedCall/add_1", "PartitionedCall/onnx_tf_prefix_Slice_8/begin", "PartitionedCall/onnx_tf_prefix_Slice_8/size"], "attr": {"Index": {"type": "DT_INT64"}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity_1", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Slice_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/onnx_tf_prefix_Slice_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_2", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_Slice_8", "PartitionedCall/transpose_2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "PartitionedCall/add_2", "op": "AddV2", "input": ["PartitionedCall/MatMul_2", "PartitionedCall/mul_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/onnx_tf_prefix_Tanh_11", "op": "Tanh", "input": ["PartitionedCall/add_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/MatMul_3", "op": "MatMul", "input": ["PartitionedCall/onnx_tf_prefix_Tanh_11", "PartitionedCall/transpose_3"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}}}, {"name": "PartitionedCall/add_3", "op": "AddV2", "input": ["PartitionedCall/MatMul_3", "PartitionedCall/mul_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity_2", "op": "Identity", "input": ["PartitionedCall/add_3"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 808}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/onnx_tf_prefix_Slice_9/begin", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_9/size", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_ReduceL2_0/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "PartitionedCall/Const_1", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/clip_by_value/y", "shape": [], "dtype": "float32"}, {"name": "PartitionedCall/ones", "shape": [1, 409], "dtype": "float32"}, {"name": "PartitionedCall/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/transpose", "shape": [409, 200], "dtype": "float32"}, {"name": "PartitionedCall/mul_2", "shape": [200], "dtype": "float32"}, {"name": "PartitionedCall/transpose_1", "shape": [200, 200], "dtype": "float32"}, {"name": "PartitionedCall/mul_4", "shape": [200], "dtype": "float32"}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_8/begin", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/onnx_tf_prefix_Slice_8/size", "shape": [2], "dtype": "int32"}, {"name": "PartitionedCall/transpose_2", "shape": [100, 200], "dtype": "float32"}, {"name": "PartitionedCall/mul_6", "shape": [200], "dtype": "float32"}, {"name": "PartitionedCall/transpose_3", "shape": [200, 409], "dtype": "float32"}, {"name": "PartitionedCall/mul_8", "shape": [409], "dtype": "float32"}]}]}